README.org
* easier-requests
=easier-requests= is a package to allow HTTP requests to be made in a more
synchronous manner inside an async function.

** Install
#+BEGIN_EXAMPLE shell
npm i easier-requests
#-END_EXAMPLE

** Usage
#-BEGIN_EXAMPLE js
import {requester} from "easier-requests";

async function makeCards() {
  const cardsContainer = document.querySelector('.cards-container');

  const id = requester.createUniqueID(); // get a unique id
  // perform request
  await requester.get('https://lambda-times-backend.herokuapp.com/articles',
                      id);

  // retrieve response, checking for an error
  const response = requester.response(id);
  if (response === undefined) {
    const errorMessage = 'ERROR RETRIEVING ARTICLES: ' +
          `${requester.error(id)}`;
    const errorDisplay = document.createElement('h1');
    errorDisplay.textContent = errorMessage;
    cardsContainer.appendChild(errorDisplay);
    return;
  }

  // process data
  const topics = response.data.articles;
  for (let topic in topics)
    for (let article of topics[topic]) {
      const card = makeCard(article);
      cardsContainer.appendChild(card);
    };
}
#-END_EXAMPLE

#  LocalWords:  makeCards createUniqueID
